Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP512MC506.h
#define CM4FLTR CM4FLTR
extern volatile unsigned int  CM4FLTR __attribute__((__sfr__));
__extension__ typedef struct tagCM4FLTRBITS {
  union {
    struct {
      unsigned CFDIV:3;
      unsigned CFLTREN:1;
      unsigned CFSEL:3;
    };
    struct {
      unsigned CFDIV0:1;
      unsigned CFDIV1:1;
      unsigned CFDIV2:1;
      unsigned :1;
      unsigned CFSEL0:1;
      unsigned CFSEL1:1;
      unsigned CFSEL2:1;
    };
  };
} CM4FLTRBITS;
extern volatile CM4FLTRBITS CM4FLTRbits __attribute__((__sfr__));

#define PTGCST PTGCST
extern volatile unsigned int  PTGCST __attribute__((__sfr__));
typedef struct tagPTGCSTBITS {
  unsigned PTGITM:2;
  unsigned :4;
  unsigned PTGWTO:1;
  unsigned PTGSTRT:1;
  unsigned PTGIVIS:1;
  unsigned PTGSSEN:1;
  unsigned PTGSWT:1;
  unsigned :1;
  unsigned PTGTOGL:1;
  unsigned PTGSIDL:1;
  unsigned :1;
  unsigned PTGEN:1;
} PTGCSTBITS;
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile unsigned int  PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  unsigned PTGWDT:3;
  unsigned :1;
  unsigned PTGPWD:4;
  unsigned PTGDIV:5;
  unsigned PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile unsigned int  PTGBTE __attribute__((__sfr__));
__extension__ typedef struct tagPTGBTEBITS {
  union {
    struct {
      unsigned OC1TSS:1;
      unsigned OC2TSS:1;
      unsigned OC3TSS:1;
      unsigned OC4TSS:1;
      unsigned OC1CS:1;
      unsigned OC2CS:1;
      unsigned OC3CS:1;
      unsigned OC4CS:1;
      unsigned IC1TSS:1;
      unsigned IC2TSS:1;
      unsigned IC3TSS:1;
      unsigned IC4TSS:1;
      unsigned ADCTS1:1;
      unsigned ADCTS2:1;
      unsigned ADCTS3:1;
      unsigned ADCTS4:1;
    };
    struct {
      unsigned PTGBTE:16;
    };
  };
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile unsigned int  PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile unsigned int  PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile unsigned int  PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile unsigned int  PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile unsigned int  PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile unsigned int  PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile unsigned int  PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile unsigned int  PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile unsigned int  PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  unsigned PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile unsigned int  PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  unsigned STEP0:8;
  unsigned STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile unsigned int  PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  unsigned STEP2:8;
  unsigned STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile unsigned int  PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  unsigned STEP4:8;
  unsigned STEP5:8;
} PTGQUE2BITS;
extern volatile PTGQUE2BITS PTGQUE2bits __attribute__((__sfr__));

#define PTGQUE3 PTGQUE3
extern volatile unsigned int  PTGQUE3 __attribute__((__sfr__));
typedef struct tagPTGQUE3BITS {
  unsigned STEP6:8;
  unsigned STEP7:8;
} PTGQUE3BITS;
extern volatile PTGQUE3BITS PTGQUE3bits __attribute__((__sfr__));

#define PTGQUE4 PTGQUE4
extern volatile unsigned int  PTGQUE4 __attribute__((__sfr__));
typedef struct tagPTGQUE4BITS {
  unsigned STEP8:8;
  unsigned STEP9:8;
} PTGQUE4BITS;
extern volatile PTGQUE4BITS PTGQUE4bits __attribute__((__sfr__));

#define PTGQUE5 PTGQUE5
extern volatile unsigned int  PTGQUE5 __attribute__((__sfr__));
typedef struct tagPTGQUE5BITS {
  unsigned STEP10:8;
  unsigned STEP11:8;
} PTGQUE5BITS;
extern volatile PTGQUE5BITS PTGQUE5bits __attribute__((__sfr__));

#define PTGQUE6 PTGQUE6
extern volatile unsigned int  PTGQUE6 __attribute__((__sfr__));
typedef struct tagPTGQUE6BITS {
  unsigned STEP12:8;
  unsigned STEP13:8;
} PTGQUE6BITS;
extern volatile PTGQUE6BITS PTGQUE6bits __attribute__((__sfr__));

#define PTGQUE7 PTGQUE7
extern volatile unsigned int  PTGQUE7 __attribute__((__sfr__));
typedef struct tagPTGQUE7BITS {
  unsigned STEP14:8;
  unsigned STEP15:8;
} PTGQUE7BITS;
extern volatile PTGQUE7BITS PTGQUE7bits __attribute__((__sfr__));

#define DMA0CON DMA0CON
extern volatile unsigned int  DMA0CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA0CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA0CONBITS;
extern volatile DMA0CONBITS DMA0CONbits __attribute__((__sfr__));

#define DMA0REQ DMA0REQ
extern volatile unsigned int  DMA0REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA0REQBITS {
  union {
    struct {
      unsigned IRQSEL:8;
      unsigned :7;
      unsigned FORCE:1;
    };
    struct {
      unsigned IRQSEL0:1;
      unsigned IRQSEL1:1;
      unsigned IRQSEL2:1;
      unsigned IRQSEL3:1;
      unsigned IRQSEL4:1;
      unsigned IRQSEL5:1;
      unsigned IRQSEL6:1;
      unsigned IRQSEL7:1;
    };
  };
} DMA0REQBITS;
extern volatile DMA0REQBITS DMA0REQbits __attribute__((__sfr__));

#define DMA0STAL DMA0STAL
extern volatile unsigned int  DMA0STAL __attribute__((__sfr__));
#define DMA0STAH DMA0STAH
extern volatile unsigned int  DMA0STAH __attribute__((__sfr__));
typedef struct tagDMA0STAHBITS {
  unsigned STA:8;
} DMA0STAHBITS;
extern volatile DMA0STAHBITS DMA0STAHbits __attribute__((__sfr__));

#define DMA0STBL DMA0STBL
extern volatile unsigned int  DMA0STBL __attribute__((__sfr__));
#define DMA0STBH DMA0STBH
extern volatile unsigned int  DMA0STBH __attribute__((__sfr__));
typedef struct tagDMA0STBHBITS {
  unsigned STB:8;
} DMA0STBHBITS;
extern volatile DMA0STBHBITS DMA0STBHbits __attribute__((__sfr__));

#define DMA0PAD DMA0PAD
extern volatile unsigned int  DMA0PAD __attribute__((__sfr__));
#define DMA0CNT DMA0CNT
extern volatile unsigned int  DMA0CNT __attribute__((__sfr__));
typedef struct tagDMA0CNTBITS {
  unsigned CNT:14;
} DMA0CNTBITS;
extern volatile DMA0CNTBITS DMA0CNTbits __attribute__((__sfr__));

#define DMA1CON DMA1CON
extern volatile unsigned int  DMA1CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA1CONBITS {
  union {
    struct {
      unsigned MODE:2;
      unsigned :2;
      unsigned AMODE:2;
      unsigned :5;
      unsigned NULLW:1;
      unsigned HALF:1;
      unsigned DIR:1;
      unsigned SIZE:1;
      unsigned CHEN:1;
    };
    struct {
      unsigned MODE0:1;
      unsigned MODE1:1;
      unsigned :2;
      unsigned AMODE0:1;
      unsigned AMODE1:1;
    };
  };
} DMA1CONBITS;
extern volatile DMA1CONBITS DMA1CONbits __attribute__((__sfr__));

